/**
 * Created by Administrator on 2017/10/24 0024.
 * 监控点显示
 */
var Sx = '../resources/cmd/image/cream.png';
var ZBOAT_DATA={
    total:4,
    items:[{id:1,name:"执法船001",Y:120.479160,X:32.043300},
        {id:2,name:"执法船006",Y:120.666280, X:32.000220},
        {id:3,name:"执法船004",Y:120.685160,X:32.000510},
        {id:4,name:"执法船003",Y:120.762060,X:31.976630}
    ]
};
var CBOAT_DATA={
    total:4,
    items:[{id:1,name:"采砂船001",Y:120.726360,X:32.004580},
        {id:2,name:"采砂船002",Y:120.578730, X:32.024960},
        {id:3,name:"采砂船003",Y:120.704730,X:32.027870},
        {id:4,name:"采砂船004",Y:120.570830,X:31.999340}
    ]
};

var YBOAT_DATA={
    total:4,
    items:[{id:1,name:"运砂船001",Y:120.497360,X:32.062790},
        {id:2,name:"运砂船002",Y:120.769960, X:31.970220},
        {id:3,name:"运砂船003",Y:120.714680,X:32.036310},
        {id:4,name:"运砂船004",Y:120.787120,X:31.998470}
    ]
};

var ZCAR_DATA={
    total:4,
    items:[{id:1,name:"执法车001",Y:120.478130,X:31.996430},
        {id:2,name:"执法车002",Y:120.551610, X:31.994100},
        {id:3,name:"执法车003",Y:120.595890,X:31.948380},
        {id:4,name:"执法车004",Y:120.732540,X:31.980710}
    ]
};
var PEOPLE_DATA={
    total:4,
    items:[{id:1,name:"张三",Y:120.471950,X:32.022340},
        {id:2,name:"李四",Y:120.603450, X:31.982160},
        {id:3,name:"小明",Y:120.430760,X:31.982450},
        {id:4,name:"大华",Y:120.570490,X:31.985950}
    ]
};

var SX_DATA={
    total:3,
    items:[{id:1,name:"长江云1号",Y:120.379260,X:31.980410},
        {id:2,name:"长江云2号",Y:120.436590, X:32.019430},
        {id:3,name:"长江云3号",Y:120.838540,X:31.817410}
    ]
};


polylineJson={
    "paths": [[[120.449980,31.993520], [120.447920,32.007640], [120.443970,32.018410],
        [120.445350,32.028600],[120.454790,32.036600], [120.469720,32.038200],
        [120.485690,32.035580], [120.502000,32.029620], [120.517620,32.023070],
        [120.534100,32.017830],[120.547660,32.014190],[120.560020,32.011420]]],
    "spatialReference":{"wkid":4326}
};
people_routeJson={
    "paths": [[[120.449980,31.993520], [120.447920,32.007640], [120.443970,32.018410],
        [120.445350,32.028600],[120.454790,32.036600], [120.469720,32.038200],
        [120.485690,32.035580], [120.502000,32.029620], [120.517620,32.023070],
        [120.534100,32.017830],[120.547660,32.014190],[120.560020,32.011420]]],
    "spatialReference":{"wkid":4326}
};
prouteJson={
    "paths": [[[120.449980,31.993520], [120.447920,32.007640], [120.443970,32.018410],
        [120.445350,32.028600],[120.454790,32.036600], [120.469720,32.038200],
        [120.485690,32.035580], [120.502000,32.029620], [120.517620,32.023070],
        [120.534100,32.017830],[120.547660,32.014190],[120.560020,32.011420],
        [120.572890,32.009390],[120.585940,32.007200],[120.597950,32.003710]]],
    "spatialReference":{"wkid":4326}
};
var ring = [[120.366127,31.961717],
    [120.366222,31.965349],[120.366322,31.968645],[120.367272,31.995931],
    [120.369862,31.99806],[120.37625,32.003288],[120.378125,32.004758],[120.381314,32.007223],[120.381989,32.007711],
    [120.384148,32.009199],[120.399686,32.0197],[120.402707,32.021703],[120.403085,32.021951],[120.403367,32.022104],
    [120.404469,32.022699],[120.406857,32.023973],[120.409646,32.025453],[120.414235,32.027822],[120.416718,32.029054],
    [120.421712,32.031499],[120.447198,32.043954],[120.44906,32.044858],[120.449743,32.045152],[120.450139,32.0453],[120.450361,32.045354],
    [120.456476,32.046712],[120.457174,32.046857],[120.457582,32.046914],[120.458066,32.046971],[120.458322,32.046979],
    [120.490655,32.047882],[120.491216,32.047852],[120.491678,32.047814],[120.499105,32.046871],[120.5,32.046751],
    [120.500123,32.046734],[120.501336,32.046547],[120.50982,32.036461],[120.510423,32.035786],[120.51109,32.035137],[120.512178,32.034157],
    [120.514188,32.032501],[120.515969,32.031197],[120.517789,32.029877],[120.519704,32.028565],[120.521299,32.027538],[120.523824,32.026024],
    [120.524766,32.025471],[120.526628,32.024429],[120.552583,32.011318],[120.560239,32.008533],[120.562032,32.00803],[120.571893,32.00613],
    [120.572175,32.006076],[120.574429,32.005714],[120.576714,32.005397],[120.57853,32.005245],[120.579965,32.005145],[120.581448,32.005145],
    [120.621564,32.005263],[120.643334,32.005992],[120.644078,32.006053],[120.649175,32.006461],[120.652558,32.006732],[120.654077,32.0068],
    [120.698892,32.008528],[120.699823,32.008543],[120.701734,32.008558],[120.704507,32.008577],[120.712888,32.008623],[120.721349,32.008646],
    [120.724145,32.008646],[120.729799,32.0086],[120.756273,32.007818],[120.760125,32.0077],[120.76587,32.007364],[120.768213,32.007207],
    [120.77049,32.007047],[120.771844,32.006952],[120.772176,32.006925],[120.772397,32.006879],[120.772813,32.006791],[120.773526,32.006616],
    [120.774041,32.006467],[120.774564,32.00628],[120.775148,32.006006],[120.777429,32.004869],[120.779699,32.003709],[120.780469,32.003312],
    [120.781076,32.002958],[120.781396,32.002755],[120.782247,32.002191],[120.7825,32.001998],[120.782502,32.001996],[120.782575,32.001939],
    [120.782849,32.001676],[120.782858,32.001666],[120.783342,32.001138],[120.783872,32.000493],[120.784177,32.000112],[120.799672,31.977342],
    [120.803811,31.966977],[120.806595,31.961991],[120.818135,31.941819],[120.820381,31.937913],[120.821896,31.935281],[120.822666,31.933972],
    [120.830422,31.920857],[120.8372,31.909436],[120.840149,31.904438],[120.841129,31.902764],[120.855518,31.877793],[120.857129,31.874949],
    [120.859346,31.870818],[120.853698,31.8636],[120.851998,31.86153],[120.846918,31.855],[120.846248,31.8541],
    [120.845208,31.85247],[120.844108,31.85054],[120.843098,31.84874],[120.838797,31.83968],[120.838527,31.83896],[120.837947,31.83734],
    [120.837707,31.8366],[120.837564,31.835985],[120.837499,31.834636],[120.837627,31.833538],[120.837792,31.832957],[120.838372,31.831377],
    [120.838614,31.830736],[120.839216,31.829217],[120.839411,31.828595],[120.839837,31.827107],[120.840000,31.825650],[120.840170,31.823130],
    [120.839940,31.820160],[120.839740,31.819340],[120.839130,31.820840],[120.838030,31.822780],[120.836940,31.823450],[120.835200,31.825060],
    [120.833610,31.828200],[120.833090,31.828520],[120.822660,31.843480],[120.821990,31.844890],[120.821090,31.846840],[120.820210,31.849640],
    [120.814080,31.868560],[120.813300,31.871140],[120.813000,31.872910],[120.811690,31.874410],[120.810560,31.876570],[120.810020,31.877440],
    [120.809780,31.877780],[120.809760,31.878120],[120.809340,31.879550],[120.802530,31.890890],[120.794080,31.897600],[120.778200,31.921790],
    [120.771330,31.956900],[120.766870,31.958860],[120.756740,31.969060],[120.753740,31.970370],[120.738800,31.986170],[120.718800,31.993300],
    [120.694600,31.994540],[120.664130,31.992860],[120.660270,31.990100],[120.617440,31.990320],[120.609710,31.987690],[120.606710,31.988420],
    [120.548520,32.000580],[120.534950,32.005670],[120.529680,32.006840],[120.480020,32.023690],[120.480370,32.024720],[120.479960,32.026010],
    [120.476980,32.027060],[120.471910,32.028110],[120.464560,32.027860],[120.460170,32.027280],[120.457940,32.026490],[120.452730,32.026100],
    [120.451290,32.025690],[120.448580,32.023310],[120.448590,32.023160],[120.447920,32.021470],[120.448130,32.021340],[120.448680,32.021330],
    [120.449020,32.019700],[120.447960,32.019170],[120.448200,32.016550],[120.449680,32.010840],[120.450200,32.010330],[120.452430,32.008990],
    [120.455000,32.004220],[120.454100,32.004110],[120.456590,31.999560],[120.456330,31.995850],[120.459550,31.995650],[120.459700,31.994410],
    [120.456590,31.994140],[120.456200,31.992460],[120.455730,31.987590],[120.455410,31.986980],[120.455500,31.985910],[120.455300,31.985330],
    [120.445820,31.974150],[120.444720,31.973790],[120.435300,31.969780],[120.426460,31.967490],[120.386640,31.967820],[120.385460,31.967330],
    [120.381490,31.967270],[120.380390,31.967040],[120.375390,31.967160],[120.372820,31.966530],[120.371360,31.966510],[120.366127,31.961717]];


function show(data,image){
    var items= data.items;
    for(var i=0;i<data.total;i++){
        var pt=new esri.geometry.Point(items[i].Y,items[i].X,new esri.SpatialReference({wkid:4326}));
        var symbol = new esri.symbol.PictureMarkerSymbol(image, 25, 25);
        var graphic = new esri.Graphic(pt,symbol,items[i]);
        allMap.graphics.add(graphic);
    }
};

//执法船
function showZboat(){
    Zboat = '../resources/cmd/image/zboat.png';
    show(ZBOAT_DATA,Zboat);
};

//采沙船
function showCboat(){
    Cboat = '../resources/cmd/image/cboat.png';
    show(CBOAT_DATA,Cboat);
};

//运沙船
function showYboat(){
    Yboat = '../resources/cmd/image/yboat.png';
    show(YBOAT_DATA,Yboat);
};
//执法车
function showZcar(){
    Zcar = '../resources/cmd/image/che.png';
    show(ZCAR_DATA,Zcar);
};

//执法人
function showPeople(){
    People = '../resources/cmd/image/people.png';
    show(PEOPLE_DATA,People);
};
//摄像头
function showSX(){
    show(SX_DATA,Sx);
};
//执法区域
function showArea(ring){
    var polygon = new esri.geometry.Polygon(new esri.SpatialReference({ wkid: 4326 }));
    polygon.addRing(ring);
    var symbol = new esri.symbol.SimpleFillSymbol(esri.symbol.SimpleFillSymbol.STYLE_SOLID, new esri.symbol.SimpleLineSymbol(esri.symbol.SimpleLineSymbol.STYLE_DASH, new dojo.Color([0,39,235]),3), new dojo.Color([154,179,241,0.7]));
    var graphic = new esri.Graphic(polygon, symbol);
    allMap.graphics.add(graphic);
}

//显示路线
function showProute(prouteJson){
    var polyline=new esri.geometry.Polyline(prouteJson);
    var sys=new esri.symbol.SimpleLineSymbol(esri.symbol.SimpleLineSymbol.STYLE_SOLID,new esri.Color('red'),3);
    var graphic=new esri.Graphic(polyline,sys);
    allMap.graphics.add(graphic);
}


//轨迹回放
function showRoute(polylineJson,img) {
    var polyline=new esri.geometry.Polyline(polylineJson);
    var sys=new esri.symbol.SimpleLineSymbol(esri.symbol.SimpleLineSymbol.STYLE_DASH,new esri.Color([0,255,0]),3);
    var graphic2=new esri.Graphic(polyline,sys);
    allMap.graphics.add(graphic2);
    var point=new esri.geometry.Point(polylineJson.paths[0][0],new esri.SpatialReference({wkid:4326}));
    var pictureMarkerSymbol=new esri.symbol.PictureMarkerSymbol(img,25,51);
    graphic=new esri.Graphic(point,pictureMarkerSymbol);
    allMap.graphics.add(graphic);
    allMap.centerAt(point);
    if(typeof(moving)!="undefined"){
        clearInterval(moving); //清除移动
    }
    points = polylineJson.paths[0];
    graphic.geometry.x = points[0][0];
    graphic.geometry.y = points[0][1];
    allMap.graphics.redraw();
    move(0,1);
}

function move(start,end){
    var x1=points[start][0];
    var y1=points[start][1];
    var x2=points[end][0];
    var y2=points[end][1];
    if(x2-x1==0){
        var p=0;
    }else{
        var p=(y2-y1)/(x2-x1);//斜率
    }
    if(p==0){
        startNum=start++;
        endNum=end++;
        if (end < points.length)
            move(start, end);
    }
    else{
        var v=0.001;//距离  距离越小 位置越精确
        moving=setInterval(function(){
            startNum=start;
            endNum=end;
            //分别计算 x,y轴方向速度
            if(Math.abs(p)==Number.POSITIVE_INFINITY||p==0){//无穷大
                graphic.geometry.y+=v;
            }
            else{
                if(x2<x1){
                    graphic.geometry.x-=(1/Math.sqrt(1+p*p))*v;
                    graphic.geometry.y-=(p / Math.sqrt(1 + p * p)) * v;
                    //计算汽车角度
                    graphic.symbol.angle =CalulateXYAnagle(x1,y1,x2,y2); //// (Math.PI / 2 - Math.atan(p)) * 180 / Math.PI+180
                }
                else{
                    graphic.geometry.x+=(1/Math.sqrt(1+p*p))*v;
                    graphic.geometry.y+=(p / Math.sqrt(1 + p * p)) * v;
                    //计算汽车角度
                    graphic.symbol.angle =CalulateXYAnagle(x1,y1,x2,y2); ////(Math.PI / 2 - Math.atan(p)) * 180 / Math.PI
                }
            }
            //图层刷新
            allMap.graphics.redraw();
            if (Math.abs(graphic.geometry.x - x2) <=v && Math.abs(graphic.geometry.y - y2) <=v) {
                clearInterval(moving);
                startNum=start++;
                endNum=end++;
                if (end < points.length)
                    move(start, end);
            }
        }, 75);
    }
}

//车头转向
function CalulateXYAnagle(startx,starty,endx,endy){
    var tan=Math.atan(Math.abs((endy-starty)/(endx-startx)))*180/Math.PI+90;
    if (endx > startx && endy > starty)//第一象限
    {
        return -tan+180;
    }
    else if (endx > startx && endy < starty)//第二象限
    {
        return tan;
    }
    else if (endx < startx && endy > starty)//第三象限
    {
        return tan - 180;
    }
    else
    {
        return - tan;
    }
}

//清除图层
function remove(type,img,style){
    for(var i=allMap.graphics.graphics.length;i>0;i--){
        if(allMap.graphics.graphics[i-1].geometry.type==type){
            if(type=='point'){
                if(allMap.graphics.graphics[i-1].symbol.url==img){
                    allMap.graphics.remove(allMap.graphics.graphics[i-1]);
                }
            }
            if(type=='polyline'){
                if(allMap.graphics.graphics[i-1].symbol.style==style){
                    allMap.graphics.remove(allMap.graphics.graphics[i-1]);
                }
            }
            if(type=='polygon'){
                allMap.graphics.remove(allMap.graphics.graphics[i-1]);
            }
        }
    }
}


